{
    "result": "success",
    "data": {
        "articles": [
            {
                "headline": "China Is Cracking Down on Bankers. Here Are Some of the Targets.",
                "keywords": [
                    "Central Commission for Discipline Inspection (Communist Party of China)",
                    "Communist Party of China",
                    "Regulation and Deregulation of Industry",
                    "Banking and Financial Institutions",
                    "China",
                    "Xi Jinping"
                ],
                "leadParagraph": "For years, Xi Jinping, China’s leader, has railed against greed and corruption in the country’s financial sector, making an example of a few prominent figures along the way.",
                "newsAbstract": "As Xi Jinping and the Communist Party further exercise control over the economy, the financial sector is coming under close scrutiny.",
                "snippet": "As Xi Jinping and the Communist Party further exercise control over the economy, the financial sector is coming under close scrutiny.",
                "webUrl": "https://www.nytimes.com/2023/04/27/business/china-banker-crackdown.html",
                "wordCount": 1149
            },
            {
                "headline": "Biden Meets Marcos in Washington Amid Tensions With China",
                "keywords": [
                    "Marcos, Ferdinand Jr",
                    "Biden, Joseph R Jr",
                    "United States Politics and Government",
                    "United States International Relations",
                    "Philippines",
                    "Far East, South and Southeast Asia and Pacific Areas",
                    "China"
                ],
                "leadParagraph": "WASHINGTON — President Biden met with President Ferdinand R. Marcos Jr. of the Philippines at the White House on Monday, a visit meant to send a message to China that the Filipino leader planned to deepen his country’s relationship with the United States.",
                "newsAbstract": "The Filipino leader’s four-day visit is meant to send a message to China amid conflict over Taiwan and the South China Sea.",
                "snippet": "The Filipino leader’s four-day visit is meant to send a message to China amid conflict over Taiwan and the South China Sea.",
                "webUrl": "https://www.nytimes.com/2023/05/01/us/politics/biden-marcos-philippines-china.html",
                "wordCount": 1020
            },
            {
                "headline": "China Detains Taiwan-Based Publisher in National Security Investigation",
                "keywords": [
                    "International Relations",
                    "Censorship",
                    "Freedom of the Press",
                    "Writing and Writers",
                    "Communist Party of China",
                    "McCarthy, Kevin (1965- )",
                    "Tsai Ing-wen",
                    "China",
                    "Taiwan",
                    "Shanghai (China)"
                ],
                "leadParagraph": "TAIPEI, Taiwan — A Taiwan-based publisher who disappeared while in China has been detained for suspected violations of security laws, Chinese authorities confirmed on Wednesday, fanning concerns in Taiwan that Beijing is sending a warning to the island’s vibrant publishing sector.",
                "newsAbstract": "Li Yanhe’s publishing company put out books that often cast a critical eye on China’s ruling Communist Party. He disappeared while on a trip to China.",
                "snippet": "Li Yanhe’s publishing company put out books that often cast a critical eye on China’s ruling Communist Party. He disappeared while on a trip to China.",
                "webUrl": "https://www.nytimes.com/2023/04/26/world/asia/china-taiwan-publisher-detained.html",
                "wordCount": 801
            },
            {
                "headline": "The Shining Promise and Dashed Dreams of China’s Live Shopping Craze",
                "keywords": [
                    "China",
                    "Shopping and Retail",
                    "Social Media",
                    "Video Recordings, Downloads and Streaming",
                    "E-Commerce",
                    "Computers and the Internet",
                    "Mobile Applications",
                    "Mobile Commerce and Payments",
                    "Beijing Kuaishou Technology Co Ltd",
                    "Douyin (ByteDance)",
                    "Regulation and Deregulation of Industry"
                ],
                "leadParagraph": "The yurt stood in the middle of a sweeping northern Chinese grassland, beneath a cloudless sky. A reedy folk tune played. Nearby, sheep grazed.",
                "newsAbstract": "Star sellers can amass huge followings and eye-popping fortunes, through a format that mixes consumerism and entertainment. But competition is fierce, and the government is watching.",
                "snippet": "Star sellers can amass huge followings and eye-popping fortunes, through a format that mixes consumerism and entertainment. But competition is fierce, and the government is watching.",
                "webUrl": "https://www.nytimes.com/2023/04/28/business/china-livestreaming-ecommerce.html",
                "wordCount": 2663
            },
            {
                "headline": "China Says Chatbots Must Toe the Party Line",
                "keywords": [
                    "Artificial Intelligence",
                    "Computers and the Internet",
                    "Regulation and Deregulation of Industry",
                    "ChatGPT",
                    "Censorship",
                    "Communist Party of China",
                    "OpenAI Labs",
                    "China"
                ],
                "leadParagraph": "Five months after ChatGPT set off an investment frenzy over artificial intelligence, Beijing is moving to rein in China’s chatbots, a show of the government’s resolve to keep tight regulatory control over technology that could define an era.",
                "newsAbstract": "The Communist Party outlined draft rules that would set guardrails on the rapidly growing industry of services like ChatGPT.",
                "snippet": "The Communist Party outlined draft rules that would set guardrails on the rapidly growing industry of services like ChatGPT.",
                "webUrl": "https://www.nytimes.com/2023/04/24/world/asia/china-chatbots-ai.html",
                "wordCount": 1181
            },
            {
                "headline": "Chinese Censorship Is Quietly Rewriting the Covid-19 Story",
                "keywords": [
                    "China",
                    "Coronavirus (2019-nCoV)",
                    "Censorship",
                    "Research",
                    "Science and Technology",
                    "Academic and Scientific Journals",
                    "Chinese Center for Disease Control and Prevention",
                    "Clinical Infectious Diseases (Journal)",
                    "World Health Organization",
                    "Wuhan (China)"
                ],
                "leadParagraph": "Early in 2020, on the same day that a frightening new illness officially got the name Covid-19, a team of scientists from the United States and China released critical data showing how quickly the virus was spreading, and who was dying.",
                "newsAbstract": "Under government pressure, Chinese scientists have retracted studies and withheld or deleted data. The censorship has stymied efforts to understand the virus.",
                "snippet": "Under government pressure, Chinese scientists have retracted studies and withheld or deleted data. The censorship has stymied efforts to understand the virus.",
                "webUrl": "https://www.nytimes.com/2023/04/23/world/europe/chinese-censorship-covid.html",
                "wordCount": 2131
            },
            {
                "headline": "Ex-Harvard Professor Sentenced in China Ties Case",
                "keywords": [
                    "your-feed-science",
                    "Colleges and Universities",
                    "Tax Evasion",
                    "Chemistry",
                    "Intellectual Property",
                    "Research",
                    "United States International Relations",
                    "Lieber, Charles M (1959- )",
                    "Harvard University",
                    "Justice Department",
                    "Wuhan University",
                    "China"
                ],
                "leadParagraph": "Charles Lieber, a former Harvard chemistry professor, was sentenced on Tuesday for making false statements to the U.S. government and for failing to declare large sums of money he’d been paid as part of a contract with a Chinese program, Thousand Talents, and Wuhan University in China.",
                "newsAbstract": "Charles Lieber had been seen as a potential Nobel Prize-winning chemist, but was convicted in 2021 of lying to federal investigators and failing to report income.",
                "snippet": "Charles Lieber had been seen as a potential Nobel Prize-winning chemist, but was convicted in 2021 of lying to federal investigators and failing to report income.",
                "webUrl": "https://www.nytimes.com/2023/04/26/science/charles-lieber-sentence-china.html",
                "wordCount": 583
            },
            {
                "headline": "Yellen Calls for ‘Constructive’ China Relationship",
                "keywords": [
                    "China",
                    "United States International Relations",
                    "United States Economy",
                    "Johns Hopkins University",
                    "Treasury Department",
                    "Yellen, Janet L",
                    "Computer Chips",
                    "Espionage and Intelligence Services",
                    "Computer Security",
                    "Biden, Joseph R Jr",
                    "Automobiles",
                    "Solar Energy"
                ],
                "leadParagraph": "WASHINGTON — Treasury Secretary Janet L. Yellen on Thursday called for a “constructive” and “healthy” economic relationship between the United States and China, one in which the two nations could work together to confront global challenges in spite of their conflicting national security interests.",
                "newsAbstract": "The Treasury secretary laid out a vision in which the United States could continue cooperating economically with China despite what she described as acute security threats.",
                "snippet": "The Treasury secretary laid out a vision in which the United States could continue cooperating economically with China despite what she described as acute security threats.",
                "webUrl": "https://www.nytimes.com/2023/04/20/business/economy/yellen-us-china-relationship.html",
                "wordCount": 978
            },
            {
                "headline": "China Tries to Limit Damage From Diplomat’s Comments That Riled Europe",
                "keywords": [
                    "International Relations",
                    "Politics and Government",
                    "Diplomatic Service, Embassies and Consulates",
                    "Russian Invasion of Ukraine (2022)",
                    "China",
                    "Baltic Region",
                    "France",
                    "USSR (Former Soviet Union)",
                    "Lu Shaye"
                ],
                "leadParagraph": "BRUSSELS — China moved on Monday to limit damage to its relations with Europe, repudiating comments made by Beijing’s ambassador in Paris, who had questioned the sovereignty of post-Soviet nations like Ukraine in a televised interview.",
                "newsAbstract": "Remarks by China’s ambassador to France questioning the sovereignty of ex-Soviet states threatened to upset China’s efforts to balance courting Europe with supporting Russia.",
                "snippet": "Remarks by China’s ambassador to France questioning the sovereignty of ex-Soviet states threatened to upset China’s efforts to balance courting Europe with supporting Russia.",
                "webUrl": "https://www.nytimes.com/2023/04/24/world/europe/china-ambassador-soviet-states.html",
                "wordCount": 1284
            },
            {
                "headline": "China’s Search Engines Have More Than 66,000 Rules Controlling Content, Report Says",
                "keywords": [
                    "China",
                    "Censorship",
                    "Search Engines",
                    "Citizen Lab",
                    "Microsoft Corp",
                    "Computers and the Internet",
                    "Research"
                ],
                "leadParagraph": "China’s internet censorship is well known, but a report has quantified the extent of it, uncovering more than 66,000 rules controlling the content that is available to people using search engines.",
                "newsAbstract": "Researchers from the Citizen Lab, a cybersecurity research group, found that the most diligent censor in China is Microsoft’s search engine Bing, the only foreign search engine operating in the country.",
                "snippet": "Researchers from the Citizen Lab, a cybersecurity research group, found that the most diligent censor in China is Microsoft’s search engine Bing, the only foreign search engine operating in the country.",
                "webUrl": "https://www.nytimes.com/2023/04/26/business/china-censored-search-engine.html",
                "wordCount": 634
            }
        ],
        "biased": [
            "Early in 2020 on the same day that a frightening new illness officially got the name Covid 19 a team of scientists from the United States and China released critical data showing how quickly the virus was spreading and who was dying.",
            "Charles Lieber a former Harvard chemistry professor was sentenced on Tuesday for making false statements to the U.S.",
            "government and for failing to declare large sums of money he’d been paid as part of a contract with a Chinese program Thousand Talents and Wuhan University in China.",
            "— China moved on Monday to limit damage to its relations with Europe repudiating comments made by Beijing’s ambassador in Paris who had questioned the sovereignty of post Soviet nations like Ukraine in a televised interview.",
            "— A Taiwan based publisher who disappeared while in China has been detained for suspected violations of security laws Chinese authorities confirmed on Wednesday fanning concerns in Taiwan that Beijing is sending a warning to the island’s vibrant publishing sector.",
            "For years Xi Jinping China’s leader has railed against greed and corruption in the country’s financial sector making an example of a few prominent figures along the way.",
            "WASHINGTON",
            "— President Biden met with President Ferdinand R. Marcos Jr.",
            "TAIPEI Taiwan",
            "The yurt stood in the middle of a sweeping northern Chinese grassland beneath a cloudless sky.",
            "A reedy folk tune played.",
            "Nearby sheep grazed.",
            "WASHINGTON",
            "BRUSSELS",
            "Five months after ChatGPT set off an investment frenzy over artificial intelligence Beijing is moving to rein in China’s chatbots a show of the government’s resolve to keep tight regulatory control over technology that could define an era.",
            "of the Philippines at the White House on Monday a visit meant to send a message to China that the Filipino leader planned to deepen his country’s relationship with the United States.",
            "China’s internet censorship is well known but a report has quantified the extent of it uncovering more than 66 000 rules controlling the content that is available to people using search engines.",
            "— Treasury Secretary Janet L. Yellen on Thursday called for a “constructive” and “healthy” economic relationship between the United States and China one in which the two nations could work together to confront global challenges in spite of their conflicting national security interests."
        ],
        "sentiment": "N"
    }
}